Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The final look of the primitive will depend on the primitive type chosen to draw (See draw_primitive_begin() for more information), the order with which you add the vertices to it, the position of the start and end points that you give for the texture sample and the colour and alpha values that you have set.
zh_cn: 图元的最终外观将取决于选择绘制的图元类型(参见draw_primitive_begin()获得更多信息)，添加顶点的顺序，纹理样本的起始点和结束点的位置，以及设置的颜色和alpha值。

source: The final look of the primitive will depend on the primitive type chosen to draw and the order with which you add the vertexes to it (see draw_primitive_begin() for more information) and the vertexes with different colours and alphas will blend smoothly from one to the other.
zh_cn: 图元的最终外观将取决于所选择的绘制的图元类型和添加顶点的顺序(更多信息请参阅draw_primitive_begin())，具有不同颜色和alpha的顶点将顺利地从一个顶点混合到另一个顶点。

source: The final look of the primitive will depend on the primitive type chosen to draw and the order with which you add the vertexes to it.
zh_cn: 图元的最终外观将取决于所选择的绘制图元类型以及向其添加顶点的顺序。

source: The final value for the group volume.
zh_cn: 最终的组的音量值。

source: The first alpha is that which all particles will start with, and the second alpha is the one on with which the particle will end with, and a smooth gradient change will occur to the alpha over the particles lifetime from one to the other.
zh_cn: 第一个alpha是所有粒子开始时的alpha，第二个alpha是粒子结束时的alpha，在粒子的生命周期中，从一个粒子到另一个粒子的alpha会发生平滑的梯度变化。

source: The first alpha is that which all particles will start with, and the second alpha is the one that will be blended to half way through its lifetime and the third alpha is the one with which the particle will end with.
zh_cn: 第一个是所有粒子开始时的状态，第二个是在生命周期的一半会混合的状态第三个是粒子结束时的状态。

source: The first anchor point is connected to instance 1, the second anchor point is connected to instance 2 and the distance and the maxlength argument sets the maximum length constraint on the joint.
zh_cn: 第一个锚点连接到实例1，第二个锚点连接到实例2,distance和maxlength参数设置了关节的最大长度约束。

source: The first anchor point is connected to instance 1, the second anchor point is connected to instance 2 and the distance between these points imply the length of the distance constrain.
zh_cn: 第一个锚点连接到实例1，第二个锚点连接到实例2，这些点之间的距离意味着距离约束的长度。

source: The first angle to use.
zh_cn: 第一个角度。

source: The first character in a string is always indexed as 1 and not 0 as you may expect, so to copy (for example) the first five characters of string you would have string_copy(str, 1, 5).
zh_cn: 字符串中的第一个字符总是被索引为1，而不是您所期望的0，所以要复制(例如)字符串的前五个字符，您需要string_copy(str，1，5)。

source: The first character to include (if you're unsure, go for 32).
zh_cn: 第一个要包含的字符(如果不确定，可以选择32)。

source: The first colour is that which all particles will start with, and the second colour is the one on which the particle will end with, and a smooth gradient change will occur to the colour over the particles lifetime from one colour to the other.
zh_cn: 第一种颜色是所有粒子开始时的颜色，第二种颜色是粒子结束时的颜色，在粒子的整个生命周期中，颜色会从一种颜色渐变到另一种颜色。

source: The first colour is that which all particles will start with, and the second colour is the one that will be blended to half way through its lifetime and the third colour is the one with which the particle will end with.
zh_cn: 第一种颜色是所有粒子开始时的颜色，第二种颜色是在其生命周期的中途混合的颜色，第三种颜色是粒子结束时的颜色。

source: The first colour the blend will take from.
zh_cn: 混合的第一个颜色。

source: The first colour to merge
zh_cn: 要合并的第一种颜色

source: The first date.
zh_cn: 第一个日期。

source: The first datetime.
zh_cn: 第一个日期时间。

source: The first input value.
zh_cn: 第一个输入值。

source: The first instance to connect with the joint
zh_cn: 与关节连接的第一个实例

source: The first is from the lower bit of the red colour value, and the second is from the lower bit of the blue colour value.
zh_cn: 第一个来自红色值的低位，第二个来自蓝色值的低位。

source: The first matrix index to use.
zh_cn: 使用的第一个矩阵索引。

source: The first particle group to join.
zh_cn: 要第一个加入的粒子组。

source: The first step in setting up a fixture is creating it with this function.
zh_cn: 设置夹具的第一步是使用此函数创建它。

source: The first texture coordinate to use (0 - 1).
zh_cn: 要使用的第一个纹理坐标(0 - 1)。

source: The first two arguments are the sprite to draw and the sub-image of the sprite (the same as in the function draw_sprite()) but the next ones are those that define the position of each of the four corners of the bounding box of the given sprite.
zh_cn: 前两个参数是要绘制的sprite和sprite的子图像(与函数draw_sprite()中的相同)，但接下来的参数是定义给定sprite的边界框的四个角的位置的参数。

source: The first value.
zh_cn: 第一个值。

source: The first x coordinate for the joint, within the game world
zh_cn: 游戏世界中关节的第一个x坐标

source: The first x coordinate.
zh_cn: 第一个x坐标。

source: The first y coordinate for the joint, within the game world
zh_cn: 游戏世界中关节的第一个y坐标

source: The first y coordinate.
zh_cn: 第一个y坐标。

source: The flag value for showing different debug features
zh_cn: 用于显示不同调试功能的标志值

source: The flag will be either true (enabled, the default value) or false (disabled).
zh_cn: 该标志将为true(启用，默认值)或false(禁用)。

source: The flags are set using any of the constants given below, and you would use the bitwise or "|" to create a single flag value to get the desired information.
zh_cn: 使用下面给出的任何常量设置标志，您可以使用位或"|"创建单个标志值，以获得所需的信息。

source: The flags themselves are set using the constants given below, and you would use the bitwise or "|" to create a single flag value to get the desired information.
zh_cn: 标志本身是使用下面给出的常量设置的，您可以使用位或"|"来创建单个标志值，以获得所需的信息。

source: The flags to set on the particle.
zh_cn: 要在粒子上设置的标志。

source: The flags to use to extract data about specific particle types.
zh_cn: 用于提取关于特定粒子类型的数据的标志。

source: The flags value for the particle.
zh_cn: 粒子的标志值。

source: The floating point value (or values) to set the shader constant to.
zh_cn: 要设置着色器常量的浮点值。

source: The fog colour
zh_cn: 雾的颜色

source: The following arguments are for setting the length of the buffer data (in bytes) from the initial offset point that you wish to load and the offset point to load the data to in the buffer (again, in bytes).
zh_cn: 以下参数用于设置缓冲区数据的长度(以字节为单位),该长度从您希望加载的初始偏移点开始，到缓冲区中要加载数据的偏移点为止(同样以字节为单位)。

source: The following constants are accepted:
zh_cn: 以下常量被接受:

source: The following constants can be used to define the data type:
zh_cn: 以下常量可用于定义数据类型:

source: The following image illustrates how this value corresponds to the HSV scale of color:
zh_cn: 下图说明了这个值是如何对应颜色的HSV尺度的:

source: The following image illustrates how this value corresponds to the HSV scale of colour:
zh_cn: 下图说明了这个值与颜色HSV标度的对应关系:

source: The following image illustrates how this works by merging the colours red and blue together:
zh_cn: 下图通过将红色和蓝色融合在一起说明了这种方法的工作原理:

source: The following image illustrates how this works:
zh_cn: 下图说明了这是如何工作的:

source: The following image illustrates this:
zh_cn: 下图说明了这一点:

source: The following image is an example of how a page with three canvas elements would be set up:
zh_cn: 下图是如何设置包含三个画布元素的页面的示例:

source: The following image shows an example:
zh_cn: 下图显示了一个示例:

source: The following images illustrate both ways that this function can be used:
zh_cn: 下图说明了通过此函数的两种方式:

source: The following two examples illustrate this:
zh_cn: 以下两个例子说明了这一点:

source: The font for which information should be retrieved.
zh_cn: 检索信息的字体。

source: The font to replace.
zh_cn: 要替换的字体。

source: The format of the buffer data to use (buffer_u8 or buffer_s16).
zh_cn: 使用的缓冲区数据的格式(buffer_u8或buffer_s16)。

source: The format of the data in the buffer (buffer_u8 or buffer_s16).
zh_cn: 缓冲区中数据的格式(buffer_u8或buffer_s16)。

source: The fourth input value.
zh_cn: 第四个输入值。

source: The fourth x coordinate.
zh_cn: 第四个x坐标。

source: The fourth y coordinate.
zh_cn: 第四个y坐标。

source: The frame index should be an real value between 0 and the number of frames for the animation (which you can get using the function skeleton_animation_get_frames).
zh_cn: 帧索引应该是一个介于0和动画帧数之间的实数值(可以使用skeleton_animation_get_frames函数获得)。

source: The frame number for the animated tile to use (default 0 for non-animated tiles)
zh_cn: 要使用的动画图块的帧号（非动画图块的默认值为 0）

source: The frame value is for telling GameMaker what part of the animation to show and is a value between 0 and the image_number.
zh_cn: frame值是用来告诉GameMaker要显示动画的哪一部分，它的值介于0和image_number之间。

source: The friction joint is a bit different to all other joints in the physics simulation in that the connection created will not constrain the instances position or movement, but rather its speed and rotation.
zh_cn: 摩擦关节与物理模拟中的所有其他关节略有不同，因为创建的连接不会约束实例的位置或移动，而是约束其速度和旋转。

source: The front side is said to be the side where the vertices are defined in counter-clockwise order.
zh_cn: 前面的边就是顶点按逆时针顺序定义的边。

source: The full URL where the comment has to be sent.
zh_cn: 要发送评论的完整URL。

source: The function can take a further 14 optional arguments (making a total of 15 possible additions), permitting you to add multiple values consecutively to the tail of the queue in a single call.
zh_cn: 此函数还可以接受14个可选参数(总共15个可能的加法)，允许您在一次调用中向队列尾部连续添加多个值。

source: The function can take a further 14 optional arguments (making a total of 15 possible additions), permitting you to push multiple values consecutively to the stack in a single call.
zh_cn: 此函数还可以接受14个可选参数(总共15个可能的加法)，允许您在一次调用中将多个值连续推入堆栈。

source: The function can take further optional arguments (as many as you require), permitting you to add multiple values consecutively to the list in a single call.
zh_cn: 此函数可以接受更多的可选参数(您需要多少就有多少)，允许您在一次调用中向列表中连续添加多个值。

source: The function does not return anything, so if you need to check if the key value has been replaced or a new key has been created, then you should use the function ds_map_replace().
zh_cn: 此函数不返回任何内容，因此如果需要检查键值是否已被替换或已创建新键，则应该使用函数ds_map_replace()。

source: The function has an optional second argument where you can supply an array that you have created, in which case the map key data will be appended onto any existing data in the array.
zh_cn: 此函数有一个可选的第二个参数，您可以在其中提供您创建的数组，在这种情况下，映射键数据将被追加到数组中的任何现有数据上。

source: The function has an optional second argument where you can supply an array that you have created, in which case the map key value data will be appended onto any existing data in the array.
zh_cn: 此函数有一个可选的第二个参数，您可以在其中提供已创建的数组，在这种情况下，映射键值数据将附加到数组中的任何现有数据。

source: The function has an upper bound of $7fffffffffffffffLL, so care should be taken if using very large numbers.
zh_cn: 此函数的上限为$7fffffffffffffffLL，因此如果使用非常大的数字，就要小心了。

source: The function has two buttons that show "Yes" and "No", and once the user has pressed one, an asynchronous Dialog event is triggered which, for the duration of that event only, will have a DS map stored in the variable async_load.
zh_cn: 此函数有两个按钮，分别显示"Yes"和"No"，一旦用户按下其中一个按钮，就会触发一个异步对话框事件，在该事件持续期间，该事件的DS map将存储在变量async_load中。

source: The function is asynchronous so your game will continue to run while the audio is loaded in the background.
zh_cn: 此函数是异步的，所以你的游戏将继续运行，而音频在后台加载。

source: The function is designed to help prevent instability in the physics simulation, especially when using very small particles which may behave unpredictably (i.e. break conservation of momentum) in scenarios such as explosions.
zh_cn: 此函数旨在帮助防止物理模拟中的不稳定性，特别是当使用非常小的粒子时，这些粒子可能会在爆炸等场景中表现出不可预测的行为(即打破动量守恒)。

source: The function is exclusively for the HTML5 platform and is only useful when loading sprites from a file using the sprite_add() function.
zh_cn: 此函数仅适用于HTML5平台，仅在使用sprite_add()函数从文件加载精灵时有用。

source: The function itself takes the index (ID) of the fixture and can tell the fixture to loop or not.
zh_cn: 此函数本身接受夹具的索引(ID ),并可以告诉夹具是否循环。

source: The function needs a buffer to store the data in and will take either a colour constant, or a hex value (using the standard GameMaker format of BGR, eg: $FF0000 for blue) as well as an alpha value from 0 (transparent) to 1 (fully opaque).
zh_cn: 此函数需要一个缓冲区来存储数据，并将采用颜色常量或十六进制值(使用BGR的标准GameMaker格式，例如:$FF0000表示蓝色)以及从0(透明)到1(完全不透明)的alpha值。

source: The function requires one of the constants listed below.
zh_cn: 此函数需要下面列出的一个常量。

source: The function requires that you supply the ID of the virtual key to delete - as returned by virtual_key_add().
zh_cn: 此函数要求您提供要删除的虚拟键的ID——由virtual_key_add()返回。

source: The function requires the filename (which can be an included file, for example) and will return the new sound index for use.
zh_cn: 此函数需要文件名(例如，可以是一个包含的文件)，并将返回用于使用的新声音索引。

source: The function requires the full IP address of the server to request from as well as the type of request to make (as a string, see the note below): "GET", "HEAD", "POST", "PUT", "DELETE", "TRACE", "OPTIONS", or "CONNECT".
zh_cn: 此函数需要请求的服务器的完整IP地址以及请求的类型(作为字符串，参见下面的注释):"GET", "HEAD", "POST", "PUT", "DELETE", "TRACE", "OPTIONS", 或 "CONNECT"。

source: The function requires you to provide a variable that holds the array and the index to get the value from within that array.
zh_cn: 此函数要求您提供一个包含数组和索引的变量，以便从数组中获取值。

source: The function requires you to provide a variable that holds the array as well as at least one value to push, although you can optionally provide further arguments and they will all be pushed onto the array in consecutive order.
zh_cn: 此函数要求您提供一个保存数组的变量以及至少一个要推入的值，不过您也可以选择提供进一步的参数，它们将以连续的顺序推入数组。

source: The function requires you to provide a variable that holds the array as well as the index to set and the value to set it to.
zh_cn: 函数要求您提供一个变量，该变量保存数组以及要设置的索引和要设置的值。

source: The function requires you to provide a variable that holds the array, the index (position) in the array to delete from, as well as the number of values to delete.
zh_cn: 此函数要求您提供一个变量来保存数组、数组中要删除的索引(位置)以及要删除的值的数量。

source: The function requires you to provide a variable that holds the array, the index (position) in the array to insert at, as well as at least one value to insert, although you can optionally provide further arguments and they will all be inserted into the array in consecutive order from the given index.
zh_cn: 此函数要求您提供一个保存数组的变量、要插入的数组中的下标(位置)以及至少一个要插入的值，尽管您可以选择提供进一步的参数，它们将从给定的下标依次插入到数组中。

source: The function requires you to provide the array to sort, and then either of the following:
zh_cn: 此函数要求您提供要排序的数组，然后执行以下操作之一:

source: The function requires you to supply one or more system flags as an integer value.
zh_cn: 此函数要求您提供一个或多个整数值形式的系统标志。

source: The function returns -1 if date1 is earlier, 0 if both dates are the same, and 1 if date1 is later.
zh_cn: 如果日期1在前面，函数返回-1；如果两个日期相同，函数返回0；如果日期1在后面，函数返回1。

source: The function returns -1 if date1 is earlier, 1 if date1 is later and 0 if they are the same, although since this takes time into account as well, a 0 for matching is very rare (it literally has to be the same second of the same day of the same month of the same year to return a 0).
zh_cn: 如果日期1较早，函数返回-1；如果日期1较晚，函数返回1；如果日期1和日期1相同，函数返回0，尽管这也考虑了时间因素，但匹配0的情况非常少见(实际上，必须是同一年同一月同一天的同一秒才能返回0)。

source: The function returns -1 if datetime1 is earlier, 1 if datetime1 is later and 0 if they are the same, and it ignores the date, so literally just which of the times is further through its given day.
zh_cn: 如果datetime1更早，函数返回-1；如果datetime1更晚，函数返回1；如果两者相同，函数返回0，并且忽略日期，因此从字面上看，哪个时间比给定日期更早。

source: The function returns a 2 element 1D array with the following elements in it:
zh_cn: 此函数返回一个包含以下元素的2元素1D数组:

source: The function returns a 4 element 1D array with the following elements in it which will be either true (enabled) or false (disabled).
zh_cn: 此函数返回一个4元素的1D数组，其中包含以下元素，这些元素将为真(启用)或假(禁用)。

source: The function returns a 4 element 1D array with the following elements in it:
zh_cn: 此函数返回一个4元素1D数组，其中包含以下元素:

source: The function returns a 4 element 1D array with the following information:
zh_cn: 此函数返回一个包含以下信息的4元素1D数组:

source: The function returns a struct which you can then access to setup the new sequence you have created.
zh_cn: 此函数返回一个结构，然后您可以访问该结构来设置所创建的新序列。

source: The function returns a unique buffer id that should be stored in a variable and used for all further function calls to the buffer.
zh_cn: 此函数返回一个唯一的缓冲区id，该id应该存储在一个变量中，并用于对该缓冲区的所有进一步的函数调用。

source: The function returns a unique id value which would then be used in the Asynchronous Cloud Event to retrieve the relevant information from the DS map that is created.
zh_cn: 此函数返回一个惟一的id值，然后在异步云事件中使用该值从创建的DS map中检索相关信息。

source: The function returns a unique id which should be used stored in a variable and used to identify the server in all further network functions, or a value of less than 0 if the connection fails.
zh_cn: 此函数返回一个唯一的id，该id应该存储在一个变量中，用于在所有其他网络函数中标识服务器，如果连接失败，则返回一个小于0的值。

source: The function returns an array with the following 8 elements:
zh_cn: 此函数返回一个包含以下8个元素的数组:

source: The function returns an index value that should be stored in a variable as this will be needed in all further code that refer to this font, or it will return -1 if the function fails for any reason.
zh_cn: 此函数返回一个索引值，该索引值应该存储在一个变量中，因为在所有引用该字体的后续代码中都需要这样做，否则，如果函数因任何原因失败，则返回-1。

source: The function returns either true (it succeeded in finding a path) or false (it failed) as well as setting the chosen path.
zh_cn: 此函数返回true(成功找到路径)或false(失败),并设置选择的路径。

source: The function returns the matrix ID value which can then be used in other matrix functions or to set the projection matrix of another camera (using camera_set_proj_mat()).
zh_cn: 此函数返回矩阵ID值，该值可用于其他矩阵函数或设置另一台相机的投影矩阵(使用camera_set_proj_mat())。

source: The function returns the matrix ID value which can then be used in other matrix functions or to set the view matrix of another camera (using camera_set_view_mat()).
zh_cn: 此函数返回矩阵ID值，该值可用于其他矩阵函数或设置另一台相机的视图矩阵(使用camera_set_view_mat())。

source: The function returns the new sprite index which must then be used in all further code that relates to the sprite.
zh_cn: 此函数返回新的sprite索引，该索引必须在与sprite相关的所有后续代码中使用。

source: The function returns the number of instances found, or 0 if none are found.
zh_cn: 此函数返回找到的实例数，如果没有找到，则返回0。

source: The function returns the unique ID value for the element, which can then be used in further layer functions for backgrounds.
zh_cn: 此函数返回元素的唯一ID值，该值可用于背景的其他图层函数中。

source: The function returns the unique ID value for the element, which can then be used in further layer functions for sprites.
zh_cn: 此函数返回元素的唯一ID值，然后可以在精灵的进一步层函数中使用。

source: The function returns the unique id of the instance which can then be used in further function calls to set properties etc... of that instance, but only once the game has entered the specified room.
zh_cn: 此函数返回实例的唯一id，然后在进一步的函数调用中使用该id来设置属性等。但只有当游戏进入了指定的房间。

source: The function returns true if the end of the line has been reached and false otherwise.
zh_cn: 如果到达行尾，则函数返回true，否则返回false。

source: The function returns whether the goal was reached or not.
zh_cn: 此函数返回是否达到目标。

source: The function takes a (previously created) ds_list() containing the x/y position of each point of the polygon, with the even numbered positions in the list being the x coordinates, and odd numbered positions the y coordinates, ie: for a triangle, your list would have six entries, with entry 0, 2, and 4 being the x coordinates and 1, 3, and 5 being the y coordinates.
zh_cn: 此函数接受一个(先前创建的)ds_list()，其中包含多边形中每个点的x/y位置，列表中偶数编号的位置是x坐标，奇数编号的位置是y坐标，例如:对于一个三角形，您的列表将有六个条目，条目0、2和4是x坐标，1、3和5是y坐标。

source: The function takes a time value specified in microseconds (where 1,000,000 microseconds equals one second) and the default target frame time is 100 microseconds.
zh_cn: 此函数接受一个以微秒为单位的时间值(其中1,000,000微秒等于1秒)，默认目标帧时间为100微秒。

source: The function takes the id for the vertex buffer to use (as returned by the function vertex_create_buffer(), for example) with the following constants being used to define the buffer type:
zh_cn: 此函数采用要使用的顶点缓冲区的id(例如，由函数vertex_create_buffer()返回的id ),并使用以下常量来定义缓冲区类型:

source: The function takes the socket id to connect through (see network_create_socket()) and requires you to give the IP address to connect to (a string) as well as the port to connect through, and if the connection fails a value of less than 0 will be returned.
zh_cn: 此函数使用套接字id进行连接(参见network_create_socket())，并要求您提供要连接的IP地址(一个字符串)以及要连接的端口，如果连接失败，将返回小于0的值。

source: The function takes the socket id to connect through and then you must supply the buffer id which contains the data to be sent (for more information on buffers see Reference - Buffers) and finally the size (in bytes) of the data packet.
zh_cn: 此函数接受套接字id进行连接，然后必须提供包含要发送的数据的缓冲区id(有关缓冲区的更多信息，请参阅参考-缓冲区)，最后是数据包的大小(以字节为单位)。

source: The function takes the socket id to connect through, the URL to connect to and the port to use.
zh_cn: 函数接受要连接的套接字id、要连接的URL和要使用的端口。

source: The function takes the unique ID of the particle to delete, as returned by the function physics_particle_create().
zh_cn: 此函数获取要删除的粒子的唯一ID，该ID由函数physics_particle_create()返回。

source: The function takes the unique group ID of the group to delete, as returned by the function physics_particle_group_end().
zh_cn: 此函数采用要删除的组的唯一组ID，由函数physics_particle_group_end()返回。

source: The function takes the unique group IDs of the groups to join, as returned by the function physics_particle_group_end(), and you can use the function any number of times for a single group to join various soft bodies together.
zh_cn: 此函数采用要加入的组的唯一组id，如函数physics_particle_group_end()所返回的，并且您可以对单个组使用此函数任意次，以将各种柔体加入到一起。

source: The function takes the view port index (from 0 to 7) and a boolean true if it is visible and false if it is not.
zh_cn: 此函数接受视图端口索引(从0到7)和一个布尔值，如果可见则为true，如果不可见则为false。

source: The function takes the x and y position for the center of the area to delete as well as the half width and height of the rectangle (in pixels) which defines the area.
zh_cn: 此函数获取待删除区域中心的x和y位置，以及定义该区域的矩形的半宽和高度(以像素为单位)。

source: The function takes the x and y position for the center of the area to delete as well as the radius (in pixels) which defines the circular area.
zh_cn: 此函数获取待删除区域中心的x和y位置，以及定义圆形区域的半径(以像素为单位)。

source: The function to be executed as filter.
zh_cn: 要作为过滤器执行的函数。

source: The function to be executed for each array entry.
zh_cn: 为数组每一项执行的函数。

source: The function to be executed for mapping the values.
zh_cn: 为映射值而执行的函数。

source: The function to be used for element initialisation.
zh_cn: 用于元素初始化的函数。

source: The function used to perform the check.
zh_cn: 用于执行检查的函数。

source: The function used to perform the search.
zh_cn: 用于执行搜索的函数。

source: The function will also return the full line as a string, making it an easy way to read complete "chunks" of data for parsing later.
zh_cn: 此函数还将以字符串的形式返回整行，从而使读取完整的数据"块"以供以后解析成为一种简单的方法。

source: The function will also return true if the file has successfully been removed, or false in any other circumstances.
zh_cn: 如果文件已被成功删除，此函数也将返回true，否则返回false。

source: The function will ignore any value given that is longer than the length of the sound given for the "index" value.
zh_cn: 此函数将忽略任何给定的比"索引"值的声音长度更长的值。

source: The function will only work while the game is in focus and using ALT + Tab will unlock the mouse.
zh_cn: 此函数仅在游戏处于焦点时有效，使用ALT + Tab将解锁鼠标。

source: The function will only work while the game is in focus and using alt + tab will unlock the mouse.
zh_cn: 此函数只会在游戏聚焦时工作，使用alt +标签将解锁鼠标。

source: The function will populate a (previously created) DS list with the unique id values of all instances of the object that are considered to be in collision with the calling instance, and you have the option to order the list based on the distance from the origin of the instance doing the checking to the origin of the instances found to be in collision.
zh_cn: 此函数将使用被认为与调用实例碰撞的对象的所有实例的唯一id值来填充(先前创建的)DS列表，并且您可以选择根据从执行检查的实例的原点到发现碰撞的实例的原点的距离来对列表进行排序。

source: The function will return -1 if either the background element doesn't exist or the element doesn't have a valid sprite assigned to it.
zh_cn: 如果背景元素不存在或者元素没有有效的精灵分配给它，此函数将返回-1。

source: The function will return -1 if either the sprite element doesn't exist or the element doesn't have a valid sprite assigned to it.
zh_cn: 如果精灵元素不存在或元素没有有效的精灵分配给它，此函数将返回-1。

source: The function will return -1 if no animation is assigned to the specific track given.
zh_cn: 如果指定的轨道没有动画，此函数将返回-1。
